### Chapter 4

In [1]:
from pandas import Series, DataFrame

In [2]:
import pandas as pd

In [3]:
obj = Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4,7,-5,3],index=['d','b','a','c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
obj2['a']

-5

In [11]:
obj2['d']

4

In [12]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [13]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [15]:
obj2 *2

d     8
b    14
a   -10
c     6
dtype: int64

In [16]:
import numpy as np

In [17]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [18]:
'b' in obj2

True

In [19]:
'e' in obj2

False

In [20]:
sdata = {'Ohio':35000,'Texas':71000, 'Oregon':16000,'Utah':5000}

In [21]:
obj3 = Series(sdata)

In [22]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
states = ['California','Ohio','Oregon','Texas']

In [24]:
obj4 = Series(sdata,index = states)

In [25]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [26]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [28]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [29]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [30]:
obj4.name = 'population'

In [31]:
obj4.index.name = 'state'

In [32]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [33]:
obj.index =['Bob','Steve','Jeff','Ryan']

In [34]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [35]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],'year':[2000,2001,2002,2001,2002],'pop':[1.5,1.7,3.6,2.4,2.9]}

In [36]:
frame=DataFrame(data)

In [37]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [38]:
DataFrame(data,columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [39]:
frame2 = DataFrame(data,columns = ['year','state','pop','debt'],index = ['one','two','three','four','five'])

In [40]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [41]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [42]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [43]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [44]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [45]:
frame2['debt']=16.5

In [46]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [47]:
frame2['debt'] = np.arange(5.)

In [48]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [49]:
val = Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [50]:
frame2['debt'] = val

In [51]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [52]:
frame2['eastern'] = frame2.state == 'Ohio'

In [53]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [54]:
del frame2['eastern']

In [55]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [56]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [57]:
frame3 = DataFrame(pop,index=[2000,2001,2002])

In [58]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [59]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [60]:
DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [61]:
pdata = {'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}

In [62]:
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [63]:
DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [64]:
frame3.index.name = 'year'; frame3.columns.name ='state'

In [65]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [66]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [67]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

In [68]:
obj = Series(range(3),index=['a','b','c'])

In [69]:
index = obj.index

In [70]:
index

Index(['a', 'b', 'c'], dtype='object')

In [71]:
index[1:]

Index(['b', 'c'], dtype='object')

In [72]:
index = pd.Index(np.arange(3))

In [73]:
obj2 =Series([1.5,-2.5,0],index =index)

In [74]:
obj2.index is index

True

In [75]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [76]:
'Ohio' in frame3.columns

True

In [77]:
2003 in frame3.index

False

In [78]:
obj = Series([4.5,7.2,-5.3,3.6,],index=['d','b','a','c'])

In [79]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [80]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [81]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [82]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [83]:
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])

In [84]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [85]:
frame = DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])

In [86]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [87]:
frame2 = frame.reindex(['a','b','c','d'])

In [88]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [89]:
states = ['Texas','Utah','California']

In [90]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [91]:
frame.loc[['a','b','c','d'],states]

C:\Users\jmorr\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [92]:
obj = Series(np.arange(5.),index=['a','b','c','d','e'])

In [93]:
new_obj = obj.drop('c')

In [94]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [95]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [96]:
data = DataFrame(np.arange(16).reshape(4,4),index=['Ohio','Colorado','Utah','New York'],columns = ['one','two','three','four'])

In [97]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [98]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [99]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [100]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [126]:
obj = Series(np.arange(4.), index=['a','b','c','d'])

In [127]:
obj['b']

1.0

In [141]:
obj[1]

1.0

In [143]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [144]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [145]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [147]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [149]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [150]:
obj['b':'c']=5

In [151]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [152]:
data = DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns = ['one','two','three','four'])

In [153]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [154]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [156]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [157]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [158]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [159]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [161]:
data[data<5]=0

In [162]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [163]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [168]:
data.ix[['Colorado','Utah'],[3,0,1]]

C:\Users\jmorr\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [171]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [172]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [182]:
data.ix[data.three>5,:3]

C:\Users\jmorr\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\Users\jmorr\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\indexing.py:822: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  retval = getattr(retval, self.name)._getitem_axis(key, axis=i)

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [184]:
s1 = Series([7.3, -2.5,3.4,1.5],index=['a','b','c','d'])

In [185]:
s2=Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])

In [186]:
s1

a    7.3
b   -2.5
c    3.4
d    1.5
dtype: float64

In [187]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [188]:
s1+s2

a    5.2
b    NaN
c    7.0
d    NaN
e    NaN
f    NaN
g    NaN
dtype: float64

In [196]:
df1 = DataFrame(np.arange(9.).reshape((3,3)),columns=list('bcd'),index=['Ohio','Texas','Colorado'])

In [197]:
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns= list('bde'), index=['Utah','Ohio','Texas','Oregon'])

In [198]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [199]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [200]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [201]:
df1 = DataFrame(np.arange(12.).reshape((3,4)),columns=list('abcd'))

In [203]:
df2 = DataFrame(np.arange(20.).reshape((4,5)),columns=list('abcde'))

In [204]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [205]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [206]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [207]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [208]:
df1.reindex(columns = df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [209]:
arr = np.arange(12.).reshape((3,4))

In [210]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [211]:
arr[0]

array([0., 1., 2., 3.])

In [212]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [213]:
frame = DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [214]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [219]:
series = frame.iloc[0]

In [220]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [221]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [222]:
series2 = Series(range(3),index=['b','e','f'])

In [223]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [224]:
series3 = frame['d']

In [225]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [226]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [227]:
frame.sub(series3,axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [228]:
frame = DataFrame(np.random.randn(4,3),columns = list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [229]:
frame

               b         d         e
Utah   -0.981515 -0.239440 -0.861885
Ohio    0.819681 -1.493516  0.881721
Texas   0.506459 -1.133138  0.479843
Oregon -2.477615  1.287018  0.094413

In [230]:
np.abs(frame)

               b         d         e
Utah    0.981515  0.239440  0.861885
Ohio    0.819681  1.493516  0.881721
Texas   0.506459  1.133138  0.479843
Oregon  2.477615  1.287018  0.094413

In [234]:
f = lambda x: x.max() - x.min()

In [235]:
frame.apply(f)

b    3.297296
d    2.780534
e    1.743606
dtype: float64

In [236]:
frame.apply(f,axis = 1)

Utah      0.742076
Ohio      2.375237
Texas     1.639597
Oregon    3.764634
dtype: float64

In [237]:
def f(x):
    return Series([x.min(), x.max()],index=['min','max'])

In [241]:
frame.apply(f)

            b         d         e
min -2.477615 -1.493516 -0.861885
max  0.819681  1.287018  0.881721

In [242]:
format = lambda x: '%.2f' % x

In [243]:
frame.applymap(format)

            b      d      e
Utah    -0.98  -0.24  -0.86
Ohio     0.82  -1.49   0.88
Texas    0.51  -1.13   0.48
Oregon  -2.48   1.29   0.09

In [244]:
frame['e'].map(format)

Utah      -0.86
Ohio       0.88
Texas      0.48
Oregon     0.09
Name: e, dtype: object

In [245]:
obj = Series(range(4),index = ['d','a','b','c'])

In [246]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [247]:
frame = DataFrame(np.arange(8).reshape((2,4)),index = ['three','one'],columns = ['d','a','b','c'])

In [248]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [249]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [254]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [255]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [256]:
obj = Series([4,7,-3,2])

In [258]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [259]:
obj = Series([4,np.nan,7,np.nan,-3,2])

In [264]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [265]:
frame = DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})

In [266]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [268]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [269]:
frame.sort_values(by = ['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [270]:
obj = Series([7,-5,7,4,2,0,4])

In [271]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [272]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [273]:
obj.rank(ascending=False,method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [274]:
frame = DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})

In [275]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [276]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [277]:
obj = Series(range(5),index=['a','a','b','b','c'])

In [278]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [280]:
obj.index.is_unique

False

In [281]:
obj['a']

a    0
a    1
dtype: int64

In [282]:
obj['c']

4

In [283]:
df = DataFrame(np.random.randn(4,3),index=['a','a','b','b'])

In [284]:
df

          0         1         2
a -0.403541 -0.438366  0.909159
a  0.541645 -1.009035  0.254922
b -1.058904  0.156114  1.325309
b  1.182064  0.669172  0.684861

In [286]:
df.loc['b']

          0         1         2
b -1.058904  0.156114  1.325309
b  1.182064  0.669172  0.684861

In [287]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns = ['one','two'])

In [289]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [290]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [291]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [292]:
df.mean(axis = 1,skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [293]:
df.idxmax()

one    b
two    d
dtype: object

In [294]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [295]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [296]:
obj = Series(['a','a','b','c']*4)

In [297]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [298]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [299]:
all_data = {}

In [304]:
from pandas_datareader import data as web

In [309]:
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker,'1/1/2000','1/1/2020')

In [310]:
all_data

{'AAPL':                  High        Low       Open      Close       Volume  Adj Close
 Date
 2000-01-03   1.004464   0.907924   0.936384   0.999442  535796800.0   0.860883
 2000-01-04   0.987723   0.903460   0.966518   0.915179  512377600.0   0.788302
 2000-01-05   0.987165   0.919643   0.926339   0.928571  778321600.0   0.799837
 2000-01-06   0.955357   0.848214   0.947545   0.848214  767972800.0   0.730621
 2000-01-07   0.901786   0.852679   0.861607   0.888393  460734400.0   0.765229
 ...               ...        ...        ...        ...          ...        ...
 2019-12-24  71.222504  70.730003  71.172501  71.067497   48478800.0  70.353882
 2019-12-26  72.495003  71.175003  71.205002  72.477501   93121200.0  71.749733
 2019-12-27  73.492500  72.029999  72.779999  72.449997  146266000.0  71.722488
 2019-12-30  73.172501  71.305000  72.364998  72.879997  144114400.0  72.148178
 2019-12-31  73.419998  72.379997  72.482498  73.412498  100805600.0  72.675339

 [5031 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 2000-01-03  116.000000  111.875000  112.437500  116.000000  10347700.0
 2000-01-04  114.500000  110.875000  114.000000  112.062500   8227800.0
 2000-01-05  119.750000  112.125000  112.937500  116.000000  12733200.0
 2000-01-06  118.937500  113.500000  118.000000  114.000000   7971900.0
 2000-01-07  117.937500  110.625000  117.250000  113.500000  11856700.0
 ...                ...         ...         ...         ...         ...
 2019-12-24  135.619995  134.610001  135.610001  134.979996   1202100.0
 2019-12-26  135.309998  134.649994  134.979996  134.910004   2129700.0
 2019-12-27  135.750000  134.869995  135.000000  135.270004   2752200.0
 2019-12-30  135.300003  132.500000  135.199997  132.809998   4118900.0
 2019-12-31  134.119995  132.399994  132.529999  134.039993   3777500.0

              Adj Close
 Date
 2000-01-03   72.891006
 2000-01-04   70.416786
 2000-01-05   72.891006
 2000-01-06   71.634270
 2000-01-07   71.320068
 ...                ...
 2019-12-24  126.562637
 2019-12-26  126.497017
 2019-12-27  126.834549
 2019-12-30  124.527962
 2019-12-31  125.681244

 [5031 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close      Volume  \
 Date
 2000-01-03   59.312500   56.000000   58.687500   58.281250  53228400.0
 2000-01-04   58.562500   56.125000   56.781250   56.312500  54119000.0
 2000-01-05   58.187500   54.687500   55.562500   56.906250  64059600.0
 2000-01-06   56.937500   54.187500   56.093750   55.000000  54976600.0
 2000-01-07   56.125000   53.656250   54.312500   55.718750  62013600.0
 ...                ...         ...         ...         ...         ...
 2019-12-24  157.710007  157.119995  157.479996  157.380005   8989200.0
 2019-12-26  158.729996  157.399994  157.559998  158.669998  14520600.0
 2019-12-27  159.550003  158.220001  159.449997  158.960007  18412800.0
 2019-12-30  159.020004  156.729996  158.990005  157.589996  16348400.0
 2019-12-31  157.770004  156.449997  156.770004  157.699997  18369400.0

              Adj Close
 Date
 2000-01-03   37.017384
 2000-01-04   35.766914
 2000-01-05   36.144032
 2000-01-06   34.933285
 2000-01-07   35.389793
 ...                ...
 2019-12-24  155.372406
 2019-12-26  156.645950
 2019-12-27  156.932251
 2019-12-30  155.579727
 2019-12-31  155.688324

 [5031 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close      Volume  \
 Date
 2004-08-19    51.835709    47.800831    49.813290    49.982655  44871361.0
 2004-08-20    54.336334    50.062355    50.316402    53.952770  22942874.0
 2004-08-23    56.528118    54.321388    55.168217    54.495735  18342897.0
 2004-08-24    55.591629    51.591621    55.412300    52.239197  15319808.0
 2004-08-25    53.798351    51.746044    52.284027    52.802086   9232276.0
 ...                 ...          ...          ...          ...         ...
 2019-12-24  1350.260010  1342.780029  1348.500000  1343.560059    347500.0
 2019-12-26  1361.327026  1344.469971  1346.170044  1360.400024    667500.0
 2019-12-27  1364.530029  1349.310059  1362.989990  1351.890015   1038400.0
 2019-12-30  1353.000000  1334.020020  1350.000000  1336.140015   1050900.0
 2019-12-31  1338.000000  1329.084961  1330.109985  1337.020020    961800.0

               Adj Close
 Date
 2004-08-19    49.982655
 2004-08-20    53.952770
 2004-08-23    54.495735
 2004-08-24    52.239197
 2004-08-25    52.802086
 ...                 ...
 2019-12-24  1343.560059
 2019-12-26  1360.400024
 2019-12-27  1351.890015
 2019-12-30  1336.140015
 2019-12-31  1337.020020

 [3869 rows x 6 columns]}

In [312]:
price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

In [313]:
returns = price.pct_change()

In [314]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-12-24  0.000951 -0.004205 -0.000191 -0.003914
2019-12-26  0.019840 -0.000518  0.008197  0.012534
2019-12-27 -0.000380  0.002668  0.001828 -0.006256
2019-12-30  0.005935 -0.018186 -0.008619 -0.011650
2019-12-31  0.007307  0.009261  0.000698  0.000659

In [315]:
returns.MSFT.corr(returns.IBM)

0.49429391597230476

In [316]:
returns.MSFT.cov(returns.IBM)

0.00015121692833350696

In [317]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.401576  0.430228  0.468203
IBM   0.401576  1.000000  0.494294  0.395624
MSFT  0.430228  0.494294  1.000000  0.487469
GOOG  0.468203  0.395624  0.487469  1.000000

In [318]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000645  0.000164  0.000207  0.000182
IBM   0.000164  0.000260  0.000151  0.000100
MSFT  0.000207  0.000151  0.000361  0.000149
GOOG  0.000182  0.000100  0.000149  0.000357

In [319]:
returns.corrwith(returns.IBM)

AAPL    0.401576
IBM     1.000000
MSFT    0.494294
GOOG    0.395624
dtype: float64

In [322]:
returns.corrwith(volume)

AAPL   -0.052296
IBM    -0.048821
MSFT   -0.043117
GOOG    0.045434
dtype: float64

In [323]:
obj = Series(['c','a','d','a','a','b','b','c','c'])

In [324]:
uniques = obj.unique()

In [325]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [327]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [329]:
pd.value_counts(obj.values,sort=False)

c    3
b    2
d    1
a    3
dtype: int64

In [330]:
mask = obj.isin(['b','c'])

In [331]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [332]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [333]:
data = DataFrame({'Qu1':[1,3,4,3,4],'Qu2':[2,3,1,2,3],'Qu3':[1,5,2,4,4]})

In [334]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [335]:
result = data.apply(pd.value_counts).fillna(0)

In [336]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [337]:
string_data = Series(['Aardvark','artichoke',np.nan,'avocado'])

In [338]:
string_data

0     Aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [339]:
string_data[0] = None

In [340]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [348]:
from numpy import nan as NA

In [349]:
data = Series([1,NA,3.5,NA,7])

In [350]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [351]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [353]:
data = DataFrame([[1.0,6.5,3.0],[1.0,NA,NA],[NA,NA,NA],[NA,6.5,3.0]])

In [354]:
cleaned = data.dropna()

In [361]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [362]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [359]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [363]:
data[4] = NA

In [364]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [365]:
data.dropna(axis=1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [366]:
df = DataFrame(np.random.randn(7,3))

In [367]:
df.iloc[:4,1] = NA; df.iloc[:2,2]=NA

In [368]:
df

          0         1         2
0 -0.576221       NaN       NaN
1  0.747270       NaN       NaN
2 -0.807037       NaN  0.172988
3 -2.278395       NaN  0.915576
4 -0.244202  0.181652 -0.933079
5  0.142747 -0.309438 -0.551377
6 -0.027357 -0.511717 -0.610100

In [369]:
df.dropna(thresh=3)

          0         1         2
4 -0.244202  0.181652 -0.933079
5  0.142747 -0.309438 -0.551377
6 -0.027357 -0.511717 -0.610100

In [370]:
df.fillna(0)

          0         1         2
0 -0.576221  0.000000  0.000000
1  0.747270  0.000000  0.000000
2 -0.807037  0.000000  0.172988
3 -2.278395  0.000000  0.915576
4 -0.244202  0.181652 -0.933079
5  0.142747 -0.309438 -0.551377
6 -0.027357 -0.511717 -0.610100

In [372]:
df.fillna({1:0.5,3:-1})

          0         1         2
0 -0.576221  0.500000       NaN
1  0.747270  0.500000       NaN
2 -0.807037  0.500000  0.172988
3 -2.278395  0.500000  0.915576
4 -0.244202  0.181652 -0.933079
5  0.142747 -0.309438 -0.551377
6 -0.027357 -0.511717 -0.610100

In [373]:
_ = df.fillna(0,inplace=True)

In [374]:
df

          0         1         2
0 -0.576221  0.000000  0.000000
1  0.747270  0.000000  0.000000
2 -0.807037  0.000000  0.172988
3 -2.278395  0.000000  0.915576
4 -0.244202  0.181652 -0.933079
5  0.142747 -0.309438 -0.551377
6 -0.027357 -0.511717 -0.610100

In [375]:
df = DataFrame(np.random.rand(6,3))

In [377]:
df.iloc[2:,1] = NA; df.iloc[4:,2]=NA

In [378]:
df

          0         1         2
0  0.032075  0.932690  0.626819
1  0.604367  0.074362  0.621148
2  0.659883       NaN  0.069522
3  0.499723       NaN  0.076580
4  0.027217       NaN       NaN
5  0.189965       NaN       NaN

In [379]:
df.fillna(method = 'ffill')

          0         1         2
0  0.032075  0.932690  0.626819
1  0.604367  0.074362  0.621148
2  0.659883  0.074362  0.069522
3  0.499723  0.074362  0.076580
4  0.027217  0.074362  0.076580
5  0.189965  0.074362  0.076580

In [380]:
df.fillna(method = 'ffill',limit=2)

          0         1         2
0  0.032075  0.932690  0.626819
1  0.604367  0.074362  0.621148
2  0.659883  0.074362  0.069522
3  0.499723  0.074362  0.076580
4  0.027217       NaN  0.076580
5  0.189965       NaN  0.076580

In [381]:
data = Series([1,NA,3.5,NA,7])

In [382]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [384]:
data = Series(np.random.randn(10),index = [['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,2,3]])

In [385]:
data

a  1    0.274261
   2   -0.519289
   3   -0.900940
b  1    1.188762
   2    0.955268
   3   -0.362403
c  1    1.277141
   2    1.403447
d  2   -1.052859
   3   -0.508061
dtype: float64

In [386]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [387]:
data['b']

1    1.188762
2    0.955268
3   -0.362403
dtype: float64

In [389]:
data['b':'c']

b  1    1.188762
   2    0.955268
   3   -0.362403
c  1    1.277141
   2    1.403447
dtype: float64

In [391]:
data.loc[['b','d']]

b  1    1.188762
   2    0.955268
   3   -0.362403
d  2   -1.052859
   3   -0.508061
dtype: float64

In [392]:
data[:,2]

a   -0.519289
b    0.955268
c    1.403447
d   -1.052859
dtype: float64

In [393]:
data.unstack()

          1         2         3
a  0.274261 -0.519289 -0.900940
b  1.188762  0.955268 -0.362403
c  1.277141  1.403447       NaN
d       NaN -1.052859 -0.508061

In [395]:
data.unstack().stack()

a  1    0.274261
   2   -0.519289
   3   -0.900940
b  1    1.188762
   2    0.955268
   3   -0.362403
c  1    1.277141
   2    1.403447
d  2   -1.052859
   3   -0.508061
dtype: float64

In [433]:
frame = DataFrame(np.arange(12).reshape((4,3)),index=[['a','a','b','b'],[1,2,1,2]],columns = [['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [434]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [435]:
frame.index.names= ['key1','key2']

In [436]:
frame.columns.names = ['state','color']

In [437]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [438]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [413]:
pd.MultiIndex.from_arrays([['Ohio','Ohio','Colorado'],['Green','Red','Green']],names = ['state','color'])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [439]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [440]:
frame.sort_values(by='key2')

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [441]:
frame.swaplevel(0,1).sort_values(by='key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [442]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [443]:
frame.sum(level='color',axis = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [444]:
frame = DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})

In [445]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [446]:
frame2 = frame.set_index(['c','d'])

In [447]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [448]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [449]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1